xducdatx/STM32_Lab_3/Lab_3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BT1_Pin GPIO_PIN_1
#define BT1_GPIO_Port GPIOA
#define BT2_Pin GPIO_PIN_2
#define BT2_GPIO_Port GPIOA
#define BT3_Pin GPIO_PIN_3
#define BT3_GPIO_Port GPIOA
#define Green1_Pin GPIO_PIN_4
#define Green1_GPIO_Port GPIOA
#define Amber1_Pin GPIO_PIN_5
#define Amber1_GPIO_Port GPIOA
#define Red1_Pin GPIO_PIN_6
#define Red1_GPIO_Port GPIOA
#define Green2_Pin GPIO_PIN_7
#define Green2_GPIO_Port GPIOA
#define SEG7_a_Pin GPIO_PIN_0
#define SEG7_a_GPIO_Port GPIOB
#define SEG7_b_Pin GPIO_PIN_1
#define SEG7_b_GPIO_Port GPIOB
#define SEG7_c_Pin GPIO_PIN_2
#define SEG7_c_GPIO_Port GPIOB
#define SEG7_4_Pin GPIO_PIN_10
#define SEG7_4_GPIO_Port GPIOB
#define Amber2_Pin GPIO_PIN_8
#define Amber2_GPIO_Port GPIOA
#define Red2_Pin GPIO_PIN_9
#define Red2_GPIO_Port GPIOA
#define SEG7_d_Pin GPIO_PIN_3
#define SEG7_d_GPIO_Port GPIOB
#define SEG7_e_Pin GPIO_PIN_4
#define SEG7_e_GPIO_Port GPIOB
#define SEG7_f_Pin GPIO_PIN_5
#define SEG7_f_GPIO_Port GPIOB
#define SEG7_g_Pin GPIO_PIN_6
#define SEG7_g_GPIO_Port GPIOB
#define SEG7_1_Pin GPIO_PIN_7
#define SEG7_1_GPIO_Port GPIOB
#define SEG7_2_Pin GPIO_PIN_8
#define SEG7_2_GPIO_Port GPIOB
#define SEG7_3_Pin GPIO_PIN_9
#define SEG7_3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
